# **Structured Query Language**

- is a `programming language` used for **managing** and **manipulating data** held in a relational database management system (RDBMS).
- specifically designed for interacting with databases. It allows you to perform various operations like **querying** data, **inserting** new records, **updating** existing records, and **deleting** records.

## Database Structures

- In SQL, data is stored in tables, which are organized into databases.
- Each table consists of **rows** and **columns**
- `Rows` represent individual record, `Columns` represent attributes or fields of those records

In [1]:
%pip install ipython-sql

Collecting ipython-sqlNote: you may need to restart the kernel to use updated packages.

  Downloading ipython_sql-0.5.0-py3-none-any.whl.metadata (17 kB)
Collecting prettytable (from ipython-sql)
  Downloading prettytable-3.10.0-py3-none-any.whl.metadata (30 kB)
Requirement already satisfied: ipython in c:\users\arpit\onecodecamp\venv\lib\site-packages (from ipython-sql) (8.25.0)
Collecting sqlalchemy>=2.0 (from ipython-sql)
  Downloading SQLAlchemy-2.0.30-cp312-cp312-win_amd64.whl.metadata (9.8 kB)
Collecting sqlparse (from ipython-sql)
  Downloading sqlparse-0.5.0-py3-none-any.whl.metadata (3.9 kB)
Requirement already satisfied: six in c:\users\arpit\onecodecamp\venv\lib\site-packages (from ipython-sql) (1.16.0)
Collecting ipython-genutils (from ipython-sql)
  Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl.metadata (755 bytes)
Collecting typing-extensions>=4.6.0 (from sqlalchemy>=2.0->ipython-sql)
  Downloading typing_extensions-4.12.2-py3-none-any.whl.metadata (3.0 kB)
Collecting greenlet!=0.4.17 (from sqlalchemy>=2.0->ipython-sql)
  Downloading greenlet-3.0.3-cp312-cp312-win_amd64.whl.metadata (3.9 kB)
Requirement already satisfied: decorator in c:\users\arpit\onecodecamp\venv\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\arpit\onecodecamp\venv\lib\site-packages (from ipython->ipython-sql) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\arpit\onecodecamp\venv\lib\site-packages (from ipython->ipython-sql) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\arpit\onecodecamp\venv\lib\site-packages (from ipython->ipython-sql) (3.0.47)
Requirement already satisfied: pygments>=2.4.0 in c:\users\arpit\onecodecamp\venv\lib\site-packages (from ipython->ipython-sql) (2.18.0)
Requirement already satisfied: stack-data in c:\users\arpit\onecodecamp\venv\lib\site-packages (from ipython->ipython-sql) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\arpit\onecodecamp\venv\lib\site-packages (from ipython->ipython-sql) (5.14.3)
Requirement already satisfied: colorama in c:\users\arpit\onecodecamp\venv\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\arpit\onecodecamp\venv\lib\site-packages (from prettytable->ipython-sql) (0.2.13)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\arpit\onecodecamp\venv\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.4)
Requirement already satisfied: executing>=1.2.0 in c:\users\arpit\onecodecamp\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\arpit\onecodecamp\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\arpit\onecodecamp\venv\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Downloading ipython_sql-0.5.0-py3-none-any.whl (20 kB)
Downloading SQLAlchemy-2.0.30-cp312-cp312-win_amd64.whl (2.1 MB)
   ---------------------------------------- 0.0/2.1 MB ? eta -:--:--
    --------------------------------------- 0.0/2.1 MB 991.0 kB/s eta 0:00:03
   -- ------------------------------------- 0.1/2.1 MB 1.7 MB/s eta 0:00:02
   ----- ---------------------------------- 0.3/2.1 MB 2.1 MB/s eta 0:00:01
   ----------- ---------------------------- 0.6/2.1 MB 3.1 MB/s eta 0:00:01
   ------------------ --------------------- 1.0/2.1 MB 4.2 MB/s eta 0:00:01
   ---------------------------- ----------- 1.5/2.1 MB 5.2 MB/s eta 0:00:01
   ------------------------------------ --- 1.9/2.1 MB 5.7 MB/s eta 0:00:01
   ---------------------------------------  2.1/2.1 MB 6.0 MB/s eta 0:00:01
   ---------------------------------------- 2.1/2.1 MB 5.1 MB/s eta 0:00:00
Downloading ipython_genutils-0.2.0-py2.py3-none-any.whl (26 kB)
Downloading prettytable-3.10.0-py3-none-any.whl (28 kB)
Downloading sqlparse-0.5.0-py3-none-any.whl (43 kB)
   ---------------------------------------- 0.0/44.0 kB ? eta -:--:--
   ---------------------------------------- 44.0/44.0 kB 2.1 MB/s eta 0:00:00
Downloading greenlet-3.0.3-cp312-cp312-win_amd64.whl (293 kB)
   ---------------------------------------- 0.0/293.6 kB ? eta -:--:--
   ---------------------------------------- 293.6/293.6 kB 9.1 MB/s eta 0:00:00
Downloading typing_extensions-4.12.2-py3-none-any.whl (37 kB)
Installing collected packages: ipython-genutils, typing-extensions, sqlparse, prettytable, greenlet, sqlalchemy, ipython-sql
Successfully installed greenlet-3.0.3 ipython-genutils-0.2.0 ipython-sql-0.5.0 prettytable-3.10.0 sqlalchemy-2.0.30 sqlparse-0.5.0 typing-extensions-4.12.2

### Install ipython-sql package

### Load the SQL Extension

In [1]:
%load_ext sql

### Create SQLite Database

In [2]:
%sql sqlite:///sample-database.db

## Create Table

Syntax:
```
%%sql CREATE TABLE IF NOT EXISTS table-name (
    column1 data-type constraint,
    column2 data-type constraint,
    ...,
    columnN data-type constraint
);
```
Alt + Shift + Down (Windows)
Option + Shift + Down (Mac)

In [5]:
%%sql CREATE TABLE IF NOT EXISTS employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL,
    department VARCHAR(50),
    salary DECIMAL(10, 2) NOT NULL
);

 * sqlite:///sample-database.db
Done.

[]

In [6]:
%%sql 
-- Dropping a Table (Deleting)
DROP TABLE employees;

 * sqlite:///sample-database.db
Done.

[]

In [7]:
%%sql CREATE TABLE IF NOT EXISTS employees (
    employee_id INTEGER PRIMARY KEY AUTOINCREMENT, 
    first_name VARCHAR(50) NOT NULL,
    last_name VARCHAR(50) NOT NULL, 
    department VARCHAR(50),
    salary DECIMAL(10, 2) NOT NULL
);

 * sqlite:///sample-database.db
Done.

[]

### Check if the employee table is created successfully

In [8]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///sample-database.db
Done.

[('employees',), ('sqlite_sequence',)]

### Altering Table

Syntax:
```
%%sql ALTER TABLE table-name
ADD column-name data-type;
```

In [9]:
%%sql ALTER TABLE employees
ADD hire_date DATE;

 * sqlite:///sample-database.db
Done.

[]

In [10]:
%%sql
-- Checking our table's structure
PRAGMA table_info('employees');

 * sqlite:///sample-database.db
Done.

[(0, 'employee_id', 'INTEGER', 0, None, 1),
 (1, 'first_name', 'VARCHAR(50)', 1, None, 0),
 (2, 'last_name', 'VARCHAR(50)', 1, None, 0),
 (3, 'department', 'VARCHAR(50)', 0, None, 0),
 (4, 'salary', 'DECIMAL(10, 2)', 1, None, 0),
 (5, 'hire_date', 'DATE', 0, None, 0)]

In [11]:
%%sql ALTER TABLE employees
ADD performance_rating INT;

 * sqlite:///sample-database.db
Done.

[]

## Inserting Data
Syntax:
```
%%sql
INSERT INTO table-name (column1, column2, ..., columnN) 
VALUES (value1, value2, ..., valueN);
```

In [13]:
%%sql
-- no auto-increment
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hire_date, performance_rating)
VALUES (1, 'John', 'Doe', 'Sales', 50000.00, '2024-05-30', 3)

 * sqlite:///sample-database.db
1 rows affected.

[]

In [15]:
%%sql
-- auto-increment
INSERT INTO employees (first_name, last_name, department, salary, hire_date, performance_rating)
VALUES ('John', 'Doe', 'Sales', 50000.00, '2024-05-30', 3)

 * sqlite:///sample-database.db
1 rows affected.

[]

In [17]:
%%sql
alter table employees rename column hire_date to hiring_date;

 * sqlite:///sample-database.db
Done.

[]

In [18]:
%sql SELECT * FROM employees;

 * sqlite:///sample-database.db
Done.

[(1, 'John', 'Doe', 'Sales', 50000, '2024-05-30', 3),
 (2, 'John', 'Doe', 'Sales', 50000, '2024-05-30', 3)]

## Selecting Data

Syntax:
```
%sql SELECT * FROM table-name;
```

### Select Specific Columns

Syntax:
```
%%sql SELECT column1, column2, ..., columnN 
FROM table-name;
```

In [19]:
%sql SELECT first_name, last_name, department FROM employees;

 * sqlite:///sample-database.db
Done.

[('John', 'Doe', 'Sales'), ('John', 'Doe', 'Sales')]

## Update Data
Syntax:
```
UPDATE table-name 
SET column-name = new-data 
WHERE primary-key = value;
```

In [20]:
%%sql UPDATE employees
SET first_name = "Jane"
WHERE employee_id = 1;

 * sqlite:///sample-database.db
1 rows affected.

[]

#### Inserting more data

In [23]:
%%sql
-- no auto-increment
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hiring_date, performance_rating)
VALUES (2, 'Huy', 'Vo', 'Marketing', 55000.00, '2024-04-25', 4),
(3, 'Al', 'H', 'Sales', 60000.00, '2024-04-26', 5),
(4, 'Ferds', 'Davis', 'Operations', 62000.00, '2024-04-27', 2),
(5, 'Jared', 'Neil', 'Operations', 58000.00, '2024-04-28', 1);

 * sqlite:///sample-database.db
(sqlite3.IntegrityError) UNIQUE constraint failed: employees.employee_id
[SQL: -- no auto-increment
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hiring_date, performance_rating)
VALUES (2, 'Huy', 'Vo', 'Marketing', 55000.00, '2024-04-25', 4),
(3, 'Al', 'H', 'Sales', 60000.00, '2024-04-26', 5),
(4, 'Ferds', 'Davis', 'Operations', 62000.00, '2024-04-27', 2),
(5, 'Jared', 'Neil', 'Operations', 58000.00, '2024-04-28', 1);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [24]:
%%sql
-- no auto-increment
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hiring_date, performance_rating)
VALUES (2, 'Huy', 'Vo', 'Marketing', 55000.00, '2024-04-25', 4),
(3, 'Al', 'H', 'Sales', 60000.00, '2024-04-26', 5),
(4, 'Ferds', 'Davis', 'Operations', 62000.00, '2024-04-27', 2),
(5, 'Jared', 'Neil', 'Operations', 58000.00, '2024-04-28', 1);

 * sqlite:///sample-database.db
(sqlite3.IntegrityError) UNIQUE constraint failed: employees.employee_id
[SQL: -- no auto-increment
INSERT INTO employees (employee_id, first_name, last_name, department, salary, hiring_date, performance_rating)
VALUES (2, 'Huy', 'Vo', 'Marketing', 55000.00, '2024-04-25', 4),
(3, 'Al', 'H', 'Sales', 60000.00, '2024-04-26', 5),
(4, 'Ferds', 'Davis', 'Operations', 62000.00, '2024-04-27', 2),
(5, 'Jared', 'Neil', 'Operations', 58000.00, '2024-04-28', 1);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [26]:
%%sql
-- auto-increment
INSERT INTO employees (first_name, last_name, department, salary, hiring_date, performance_rating)
VALUES ('Huy', 'Vo', 'Marketing', 55000.00, '2024-04-25', 4),
('Al', 'H', 'Sales', 60000.00, '2024-04-26', 5),
('Ferds', 'Davis', 'Operations', 62000.00, '2024-04-27', 2),
('Jared', 'Neil', 'Operations', 58000.00, '2024-04-28', 1);

 * sqlite:///sample-database.db
4 rows affected.

[]

## Deleting Data

Syntax:
```
DELETE FROM table-name
WHERE primary-key = value;
```

In [27]:
%%sql DELETE FROM employees
WHERE employee_id = 2;

 * sqlite:///sample-database.db
1 rows affected.

[]

In [28]:
%sql SELECT * FROM employees;

 * sqlite:///sample-database.db
Done.

[(1, 'Jane', 'Doe', 'Sales', 50000, '2024-05-30', 3),
 (3, 'Huy', 'Vo', 'Marketing', 55000, '2024-04-25', 4),
 (4, 'Al', 'H', 'Sales', 60000, '2024-04-26', 5),
 (5, 'Ferds', 'Davis', 'Operations', 62000, '2024-04-27', 2),
 (6, 'Jared', 'Neil', 'Operations', 58000, '2024-04-28', 1)]